Repository: lehronn/Snapshot-Maker
Catalog: Sources/Localization/*.lproj/Localizable.strings
Languages: es, fr

# appearance_label
source: Appearance
es: Apariencia
fr: Apparence

# appearance_system
source: System
es: Sistema
fr: Système

# appearance_light
source: Light
es: Claro
fr: Clair

# appearance_dark
source: Dark
es: Oscuro
fr: Sombre

# language_label
source: Language
es: Idioma
fr: Langue

# language_system
source: System Default
es: Predeterminado del sistema
fr: Par défaut du système

# language_en
source: English
es: Inglés
fr: Anglais

# language_pl
source: Polish
es: Polaco
fr: Polonais

# language_de
source: German
es: Alemán
fr: Allemand

# language_fr
source: French
es: Francés
fr: Français

source: Scan Location
es: Ubicación de escaneo
fr: Emplacement de scan

# scan_button
source: Scan
es: Escanear
fr: Scanner

source: Scan Path
es: Ruta de escaneo
fr: Chemin de scan

source: Choose...
es: Elegir...
fr: Choisir...

# vm_list_title
source: Virtual Machines
es: Máquinas Virtuales
fr: Machines virtuelles

# select_vm
source: Select a Virtual Machine
es: Seleccionar una Máquina Virtual
fr: Sélectionner une machine virtuelle

# path_label
source: Path
es: Ruta
fr: Chemin

# disks_label
source: Disks
es: Discos
fr: Disques

source: Open in Finder
es: Abrir en Finder
fr: Ouvrir dans le Finder

source: Snapshots
es: Instantáneas
fr: Instantanés

# no_snapshots
source: No snapshots found. Create a new snapshot using the form above.
es: No se encontraron instantáneas. Crea una nueva usando el formulario de arriba.

source: Create Snapshot
es: Crear Instantánea
fr: Créer un instantané

# delete_snapshot
source: Delete
es: Eliminar
fr: Supprimer

# restore_snapshot
source: Restore
es: Restaurar
fr: Restaurer

# snapshot_name_placeholder
source: Snapshot Name
es: Nombre de la instantánea
fr: Nom de l'instantané

# created_at
source: Created
es: Creada
fr: Créé

source: Actions
es: Acciones

# success_title
source: Success
es: Éxito
fr: Succès

source: Cancel
es: Cancelar
fr: Annuler

# snapshot_created_success
source: Snapshot created successfully
es: Instantánea creada exitosamente
fr: Instantané créé avec succès

# snapshot_deleted_success
source: Snapshot deleted successfully
es: Instantánea eliminada exitosamente
fr: Instantané supprimé avec succès

# snapshot_restored_success
source: Snapshot restored successfully
es: Instantánea restaurada exitosamente
fr: Instantané restauré avec succès

# snapshot_create_error
source: Failed to create snapshot
es: Error al crear la instantánea
fr: Échec de la création de l'instantané

# snapshot_delete_error
source: Failed to delete snapshot
es: Error al eliminar la instantánea
fr: Échec de la suppression de l'instantané

# snapshot_restore_error
source: Failed to restore snapshot
es: Error al restaurar la instantánea
fr: Échec de la restauration de l'instantané

# missing_dependencies_title
source: Missing qemu-img
es: Falta qemu-img
fr: qemu-img manquant

# missing_dependencies_message
source: qemu-img is not installed. Please install QEMU using Homebrew: brew install qemu Or the application will use the embedded binary (may be outdated).
es: qemu-img no está instalado. Instale QEMU usando Homebrew: brew install qemu O la aplicación usará el binario integrado (puede estar desactualizado).
fr: qemu-img n'est pas installé. Veuillez installer QEMU avec Homebrew: brew install qemu Ou l'application utilisera le binaire intégré (peut être obsolète).

# qemu_status_label
source: qemu-img Status
es: Estado de qemu-img
fr: Statut de qemu-img

# qemu_status_system
source: Using System Binary
es: Usando binario del sistema
fr: Utilise le binaire système

# qemu_status_embedded
source: Using Embedded Binary
es: Usando binario integrado
fr: Utilise le binaire intégré

# qemu_warning_message
source: ⚠️ You are using the embedded qemu-img binary. For best results, install qemu via Homebrew: brew install qemu
es: ⚠️ Estás usando el binario qemu-img integrado. Para mejores resultados, instala qemu vía Homebrew: brew install qemu
fr: ⚠️ Vous utilisez le binaire qemu-img intégré. Pour de meilleurs résultats, installez qemu via Homebrew: brew install qemu

# welcome_title
source: Welcome to Snapshot Maker
es: Bienvenido a Snapshot Maker
fr: Bienvenue dans Snapshot Maker

# welcome_message
source: Select a virtual machine from the sidebar to view details and manage snapshots.
es: Selecciona una máquina virtual de la barra lateral para ver detalles y gestionar instantáneas.
fr: Sélectionnez une machine virtuelle dans la barre latérale pour afficher les détails et gérer les instantanés.

# welcome_settings_hint
source: You can configure the VM scan path in Settings.
es: Puedes configurar la ruta de escaneo de VM en la Configuración.
fr: Vous pouvez configurer le chemin de scan des VM dans les Réglages.

# welcome_default_path_prefix
source: Default scan location:
es: Ubicación de escaneo predeterminada:
fr: Emplacement de scan par défaut:

# welcome_footer
source: Additional information will appear here after selecting a VM.
es: La información adicional aparecerá aquí después de seleccionar una VM.
fr: Des informations supplémentaires apparaîtront ici après avoir sélectionné une VM.

# menu_about
source: About Snapshot Maker
es: Acerca de Snapshot Maker
fr: À propos de Snapshot Maker

# menu_documentation
source: Documentation
es: Documentación

# about_version
source: Version
es: Versión

# about_author
source: Author
es: Autor
fr: Auteur

# about_license_button
source: View License
es: Ver Licencia
fr: Voir la licence

# about_disclaimer
source: This software is free and open-source, provided 'as-is' without any warranty, under the MIT License. Created with AI assistance. Not intended for production use. The author is not responsible for any errors.
es: Este software es gratuito y de código abierto, proporcionado 'tal cual' sin ninguna garantía, bajo la Licencia MIT. Creado con asistencia de IA. No destinado para uso en producción. El autor no es responsable de ningún error.
fr: Ce logiciel est gratuit et open-source, fourni 'tel quel' sans aucune garantie, sous licence MIT. Créé avec l'assistance de l'IA. Non destiné à une utilisation en production. L'auteur n'est pas responsable des erreurs.

# license_title
source: MIT License
es: Licencia MIT
fr: Licence MIT

# view_config
source: View Configuration
es: Ver Configuración
fr: Voir la configuration

# config_title
source: Configuration
es: Configuración

# loading_config
source: Loading configuration...
es: Cargando configuración...
fr: Chargement de la configuration...

# export_config
source: Export to File
es: Exportar a Archivo
fr: Exporter vers un fichier

# config_export_success
source: Configuration exported successfully.
es: Configuración exportada exitosamente.
fr: Configuration exportée avec succès.

# appearance_settings
source: Appearance
es: Apariencia
fr: Apparence

# warning_vm_running
source: ⚠️ WARNING: Never create, restore, or delete snapshots while a VM is running! This may cause severe data corruption.
es: ⚠️ ADVERTENCIA: ¡Nunca crees, restaures o elimines instantáneas mientras una VM está en ejecución! Esto puede causar corrupción grave de datos.
fr: ⚠️ AVERTISSEMENT: Ne créez, ne restaurez ou ne supprimez jamais d'instantanés pendant qu'une VM est en cours d'exécution! Cela peut causer une corruption grave des données.

# delete_confirm_title
source: Delete Snapshot
es: Eliminar Instantánea
fr: Supprimer le snapshot

# delete_confirm_message
source: Are you sure you want to delete snapshot '%@'?
es: ¿Estás seguro de que quieres eliminar la instantánea '%@'?
fr: Êtes-vous sûr de vouloir supprimer le snapshot '%@'?

# restore_confirm_title
source: Restore Snapshot
es: Restaurar Instantánea
fr: Restaurer le snapshot

# restore_confirm_message
source: Are you sure you want to restore to snapshot '%@'? This will revert the disk to this state.
es: ¿Estás seguro de que quieres restaurar a la instantánea '%@'? Esto revertirá el disco a este estado.
fr: Êtes-vous sûr de vouloir restaurer le snapshot '%@'? Cela ramènera le disque à cet état.

# settings_scan_desc
source: Scan path
es: Ruta de escaneo
fr: Chemin de scan

# settings_qemu_missing
source: qemu-img not found!
es: ¡qemu-img no encontrado!
fr: qemu-img introuvable!

# settings_qemu_missing_desc
source: Install qemu via Homebrew: brew install qemu
es: Instala qemu vía Homebrew: brew install qemu
fr: Installez qemu via Homebrew: brew install qemu

# settings_qemu_embedded
source: Using embedded qemu-img version
es: Usando versión integrada de qemu-img
fr: Utilise la version intégrée de qemu-img

# settings_qemu_embedded_desc
source: For better compatibility, install the latest version via Homebrew: brew install qemu
es: Para mejor compatibilidad, instala la última versión vía Homebrew: brew install qemu
fr: Pour une meilleure compatibilité, installez la dernière version via Homebrew: brew install qemu

# settings_qemu_system
source: Using system qemu-img installation
es: Usando instalación de sistema de qemu-img
fr: Utilise l'installation système de qemu-img

# settings_qemu_system_desc
source: Everything is configured correctly.
es: Todo está configurado correctamente.
fr: Tout est configuré correctement.

# settings_appearance_desc
source: Choose application color theme
es: Elige el tema de color de la aplicación
fr: Choisissez le thème de couleur de l'application

# settings_language_desc
source: Choose interface language
es: Elige el idioma de la interfaz
fr: Choisissez la langue de l'interface

# settings_tab_appearance
source: Appearance
es: Apariencia
fr: Apparence

# settings_appearance_tab
source: Appearance
es: Apariencia
fr: Apparence

# settings_theme_label
source: Choose application color theme
es: Elige el tema de color de la aplicación
fr: Choisissez le thème de couleur de l'application

# settings_language_label
source: Choose interface language
es: Elige el idioma de la interfaz
fr: Choisissez la langue de l'interface

# qemu_status_missing_title
source: Missing qemu-img!
es: ¡Falta qemu-img!
fr: qemu-img est manquant!

# qemu_status_missing_desc
source: Install qemu via Homebrew: brew install qemu
es: Instala qemu vía Homebrew: brew install qemu
fr: Installez qemu via Homebrew : brew install qemu

# qemu_status_embedded_title
source: Using embedded qemu-img version
es: Usando versión integrada de qemu-img
fr: Utilise la version intégrée de qemu-img

# qemu_status_embedded_desc
source: For better compatibility install latest version via Homebrew: brew install qemu.
es: Para mejor compatibilidad instala la última versión vía Homebrew: brew install qemu.
fr: Pour une meilleure compatibilité, installez la dernière version via Homebrew : brew install qemu.

# qemu_status_system_title
source: Using system qemu-img installation
es: Usando instalación de sistema de qemu-img
fr: Utilise l'installation système de qemu-img

# qemu_status_system_desc
source: Everything is configured correctly.
es: Todo está configurado correctamente.
fr: Tout est configuré correctement.

# error_title
source: Error
fr: Erreur

# general_settings
source: General
fr: Général

# settings_tab_general
source: General
fr: Général

# settings_general_tab
source: General
fr: Général
